app/Controllers/BaseController.php

SELECT *
FROM `system`
WHERE `status` = 1
---
    public function getSystemMenu($is_admin)
    {
        $this->db = Database::connect();
        if($is_admin){
            return $this->db->table('system')->where('status', 1)->get()->getResult();